import { getImagesByQuery, data } from './js/pixabay-api';


/*У файлі render - functions.js створи екземпляр 
SimpleLightbox для роботи з модальним вікном 
та зберігай функції для відображення елементів інтерфейсу:
*/

/*Ця функція повинна приймати масив images, 
створювати HTML-розмітку для галереї, 
додавати її в контейнер галереї та викликати 
метод екземпляра SimpleLightbox refresh(). 
Нічого не повертає.
*/
createGallery(images)

/*. Ця функція нічого не приймає та повинна 
очищати вміст контейнера галереї. 
Нічого не повертає.*/
clearGallery()

/*. Ця функція нічого не приймає, повинна 
додавати клас для відображення лоадера. 
Нічого не повертає.*/
showLoader()

/*. Ця функція нічого не приймає, повинна 
прибирати клас для відображення лоадера. 
 не повертає.*/
hideLoader()

/*. Ця функція нічого не приймає, повинна 
додавати клас для відображення кнопки Load more. 
Нічого не повертає.*/
showLoadMoreButton()

/*. Ця функція нічого не приймає, повинна 
прибирати клас для відображення кнопки Load more. 
Нічого не повертає.*/
hideLoadMoreButton()